; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared2 - mode
	image3 - mode
	thermograph0 - mode
	infrared1 - mode
	Star0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation8 - direction
	Star9 - direction
	Star11 - direction
	Star12 - direction
	Star14 - direction
	Star16 - direction
	GroundStation18 - direction
	Star19 - direction
	GroundStation22 - direction
	Star23 - direction
	GroundStation21 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation10 - direction
	GroundStation20 - direction
	GroundStation6 - direction
	Star17 - direction
	GroundStation15 - direction
	Star24 - direction
	Star7 - direction
	Star13 - direction
	Planet25 - direction
	Star26 - direction
	Star27 - direction
	Star28 - direction
	Star29 - direction
	Planet30 - direction
	Star31 - direction
	Planet32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Phenomenon35 - direction
	Phenomenon36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Planet39 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 GroundStation21)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation21)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation21)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation20)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star24)
	(calibration_target instrument4 GroundStation15)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument5 thermograph0)
	(supports instrument5 image3)
	(calibration_target instrument5 Star13)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet25)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Planet25 infrared1)
	(have_image Star26 infrared1)
	(have_image Star27 image3)
	(have_image Star28 thermograph0)
	(have_image Star29 thermograph0)
	(have_image Planet30 infrared1)
	(have_image Star31 infrared1)
	(have_image Planet32 infrared1)
	(have_image Planet33 image3)
	(have_image Phenomenon34 image3)
	(have_image Phenomenon35 infrared1)
	(have_image Phenomenon36 image3)
	(have_image Star37 infrared1)
	(have_image Phenomenon38 image3)
	(have_image Planet39 image3)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 16
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
3. (calibrate satellite0 instrument0 groundstation21)
   added: (calibrated instrument0)
   goals met: 0 of 16
4. (turn_to satellite2 phenomenon34 planet25)
   deleted: (pointing satellite2 planet25)
   added: (pointing satellite2 phenomenon34)
   goals met: 0 of 16
5. (turn_to satellite0 phenomenon35 groundstation21)
   deleted: (pointing satellite0 groundstation21)
   added: (pointing satellite0 phenomenon35)
   goals met: 0 of 16
6. (take_image satellite0 phenomenon35 instrument0 infrared1)
   added: (have_image phenomenon35 infrared1)
   goals met: 1 of 16
7. (turn_to satellite0 planet25 phenomenon35)
   deleted: (pointing satellite0 phenomenon35)
   added: (pointing satellite0 planet25)
   goals met: 1 of 16
8. (take_image satellite0 planet25 instrument0 infrared1)
   added: (have_image planet25 infrared1)
   goals met: 2 of 16
9. (turn_to satellite0 planet30 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet30)
   goals met: 2 of 16
10. (take_image satellite0 planet30 instrument0 infrared1)
   added: (have_image planet30 infrared1)
   goals met: 3 of 16
11. (turn_to satellite0 planet32 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet32)
   goals met: 3 of 16
12. (take_image satellite0 planet32 instrument0 infrared1)
   added: (have_image planet32 infrared1)
   goals met: 4 of 16
13. (turn_to satellite0 star14 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 star14)
   goals met: 5 of 16
14. (turn_to satellite2 star13 phenomenon34)
   deleted: (pointing satellite2 phenomenon34)
   added: (pointing satellite2 star13)
   goals met: 5 of 16
15. (calibrate satellite2 instrument5 star13)
   added: (calibrated instrument5)
   goals met: 5 of 16
16. (turn_to satellite2 phenomenon34 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon34)
   goals met: 5 of 16
17. (take_image satellite2 phenomenon34 instrument5 image3)
   added: (have_image phenomenon34 image3)
   goals met: 6 of 16
18. (turn_to satellite2 phenomenon36 phenomenon34)
   deleted: (pointing satellite2 phenomenon34)
   added: (pointing satellite2 phenomenon36)
   goals met: 6 of 16
19. (take_image satellite2 phenomenon36 instrument5 image3)
   added: (have_image phenomenon36 image3)
   goals met: 7 of 16
20. (turn_to satellite2 phenomenon38 phenomenon36)
   deleted: (pointing satellite2 phenomenon36)
   added: (pointing satellite2 phenomenon38)
   goals met: 7 of 16
21. (take_image satellite2 phenomenon38 instrument5 image3)
   added: (have_image phenomenon38 image3)
   goals met: 8 of 16
22. (turn_to satellite2 planet33 phenomenon38)
   deleted: (pointing satellite2 phenomenon38)
   added: (pointing satellite2 planet33)
   goals met: 8 of 16
23. (take_image satellite2 planet33 instrument5 image3)
   added: (have_image planet33 image3)
   goals met: 9 of 16
24. (turn_to satellite2 planet39 planet33)
   deleted: (pointing satellite2 planet33)
   added: (pointing satellite2 planet39)
   goals met: 9 of 16
25. (take_image satellite2 planet39 instrument5 image3)
   added: (have_image planet39 image3)
   goals met: 10 of 16
26. (turn_to satellite2 star27 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 star27)
   goals met: 10 of 16
27. (take_image satellite2 star27 instrument5 image3)
   added: (have_image star27 image3)
   goals met: 11 of 16
28. (turn_to satellite2 star28 star27)
   deleted: (pointing satellite2 star27)
   added: (pointing satellite2 star28)
   goals met: 11 of 16
29. (take_image satellite2 star28 instrument5 thermograph0)
   added: (have_image star28 thermograph0)
   goals met: 12 of 16
30. (turn_to satellite2 star29 star28)
   deleted: (pointing satellite2 star28)
   added: (pointing satellite2 star29)
   goals met: 12 of 16
31. (take_image satellite2 star29 instrument5 thermograph0)
   added: (have_image star29 thermograph0)
   goals met: 13 of 16
32. (turn_to satellite0 star26 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star26)
   goals met: 12 of 16
33. (take_image satellite0 star26 instrument0 infrared1)
   added: (have_image star26 infrared1)
   goals met: 13 of 16
34. (turn_to satellite0 star14 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star14)
   goals met: 14 of 16
35. (turn_to satellite0 star31 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star31)
   goals met: 13 of 16
36. (take_image satellite0 star31 instrument0 infrared1)
   added: (have_image star31 infrared1)
   goals met: 14 of 16
37. (turn_to satellite0 star14 star31)
   deleted: (pointing satellite0 star31)
   added: (pointing satellite0 star14)
   goals met: 15 of 16
38. (turn_to satellite0 star37 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star37)
   goals met: 14 of 16
39. (take_image satellite0 star37 instrument0 infrared1)
   added: (have_image star37 infrared1)
   goals met: 15 of 16
40. (turn_to satellite0 star14 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 star14)
   goals met: 16 of 16
